app/controllers/welcome_controller.rb

  def index
    @food_lists = FoodList.order(date: :desc)
---
SELECT "food_lists".* FROM "food_lists"   ORDER BY "food_lists"."date" ASC, "food_lists"."desc" ASC